function c = myjx(a)

global J0;
%这里用的精细准则临界值表是在显著性水平a=0.01（n=20）后续程序待优化
J0=[1.15000000000000,1.15000000000000,1.15000000000000,1.50000000000000,1.76000000000000,...
    1.97000000000000,2.14000000000000,2.27000000000000,2.38000000000000,2.48000000000000,...
    2.58000000000000,2.68000000000000,2.70000000000000,2.80000000000000,2.81000000000000,...
    2.85000000000000,2.90000000000000,2.95000000000000,2.98000000000000,3.00000000000000];


N=length(a);
if (N>20)
           msgbox('测量列个数大于20，精细准则失效！');
           pause(1);
           c=[];
%            h=gcf;
%            close(h);
else    
        for i=1:N-1
            M=length(a);
            av=mean(a);%算术平均值
            sigma=std(a);%标准差
            [x,m]=max(a);%找最大值及其相应的序号：x-最大值，m-序号
            v=abs(x-av);%残余误差绝对值
            t=J0(M)*sigma;
           if (v>t)%如果残余误差绝对值大于3倍的标准差
               a(m)=[];%剔除最大值
               i=i+1;
           else
               [xx,mm]=min(a);%找最小值及其相应的序号：x-最大值，m-序号
               vv=abs(xx-av);%残余误差绝对值
               t=J0(M)*sigma;
               if(vv>t)
                   a(mm)=[];
                   i=i+1;
               else
                   c=a;
                   i=N;
               end
           end 
        end
end